{
    "subject_number": "I",
    "total_points": "20",
    "subject_title": "SUBIECTUL I",
    "exercises": {
        "1": {
            "content": "Indicați expresia C/C++ care are cea mai mare valoare, comparativ cu celelalte trei expresii.\na. 20*23/(2*2) b. 20/2*23/2 c. (20*23)/2 d. (20*23)/2*2",
            "exercise_number": "1"
        },
        "2": {
            "content": "Subprogramul f este definit alăturat. Indicați ce se\nafișează în urma apelului de mai jos.\nf(23);\nvoid f (int n)\n{ if(n!=0) f(n/2);\n cout<<n%2; | printf(\"%d\",n%2);\n}\na. 100111 b. 111010 c. 010111 d. 01251123",
            "exercise_number": "2"
        },
        "3": {
            "content": "Variabila k este de tip întreg, iar variabila s permite memorarea unui șir\nde maximum 50 de caractere. Indicați valoarea variabilei k în urma\nexecutării secvenței alăturate.\nstrcpy(s,\"bac2023\");\ns[s[2]-'a']='\\0';\nk=strlen(s);\na. 7 b. 6 c. 2 d. 1",
            "exercise_number": "3"
        },
        "4": {
            "content": "Indicați un vector de „tați” corespunzător unui arbore cu 7 noduri, în care cel puțin unul dintre noduri are\ntrei ascendenți.\na. 0,1,2,1,1,1,2 b. 3,0,2,1,3,2,1 c. 4,3,0,3,4,4,3 d. 5,4,3,0,2,3,4",
            "exercise_number": "4"
        },
        "5": {
            "content": "O companie de colectare a fructelor are 6 depozite, numerotate de la 1 la 6: depozitele 1, 3 și 5 conțin\nmere, depozitele 2 și 4 conțin pere, iar depozitul 6 conține piersici. Compania a construit 4 benzi de\ntransport unidirecțional: de la depozitul 1 la depozitul 5, de la depozitul 5 la depozitul 2, de la depozitul 5\nla depozitul 4 și de la depozitul 6 la depozitul 1. Dacă depozitele reprezintă vârfurile unui graf orientat,\niar benzile de transport reprezintă arcele acestuia, indicați numărul minim de benzi de transport care pot\nfi adăugate, astfel încât graful obținut să aibă trei componente tare conexe, fiecare dintre acestea având\nvârfuri care corespund depozitelor cu același tip de fructe.\na. 4 b. 3 c. 2 d. 1\nSUBIECTUL al II-lea (40 de puncte)",
            "exercise_number": "5"
        }
    }
}