{
    "subject_number": "III",
    "total_points": "30",
    "subject_title": "SUBIECTUL al III-lea",
    "exercises": {
        "1": {
            "content": "Subprogramul divPrim are doi parametri:\n• n, prin care primește un număr natural (n[2,109]);\n• s, prin care furnizează suma divizorilor primi ai lui n care apar la o putere impară în\ndescompunerea în factori primi a acestuia.\nScrieți definiția completă a subprogramului.\nExemple: pentru n=360, după apel s=7 (360=23∙32∙51, deci s=2+5), iar pentru n=16, după apel s=0.(10p.)",
            "exercise_number": "1"
        },
        "2": {
            "content": "Scrieți un program C/C++ care citește de la tastatură două numere naturale n și k, apoi n cuvinte,\nseparate prin Enter. Fiecare cuvânt este format din cel mult 10 caractere, numai litere mici ale\nalfabetului englez, iar numerele citite sunt din intervalul [1,20].\nProgramul afișează pe ecran, pe linii separate, primele k cuvinte dintre cele citite pentru\ncare ultima literă este o vocală, sau doar mesajul nu exista dacă nu există k astfel de\ncuvinte. Se consideră vocale literele a, e, i, o, u.\nExemplu: dacă se citesc datele alăturate, se afișează pe ecran:\nnorii\npluteau (10p.)\n5 2\nnorii\ncumulus\npluteau\npe\ncer",
            "exercise_number": "2"
        },
        "3": {
            "content": "Numărul natural a se numește sufix al numărului natural b dacă a este egal cu b sau dacă b se poate\nobține din a prin alipirea la stânga a unor noi cifre.\nFişierul bac.txt conţine pe prima linie un număr natural x (x[100,999]), iar pe a doua linie un şir de\ncel mult 105 numere naturale din intervalul [0,109]. Numerele din şir sunt separate prin câte un spaţiu.\nSe cere să se afișeze pe ecran ultimii doi termeni ai șirului, aflați pe poziții consecutive în acesta, care\nîl au drept sufix pe numărul x. Numerele sunt afișate în ordinea în care apar în șir, separate printr-un\nspațiu, iar dacă nu există doi astfel de termeni, se afișează pe ecran mesajul nu exista. Proiectați un\nalgoritm eficient din punctul de vedere al memoriei utilizate și al timpului de executare.\nExemplu: dacă fișierul conține\nnumerele alăturate, atunci pe\necran se afișează 3210 15210\n210\n3445 210 893210 1245 1210 3210 15210 67120 20210 12\na. Descrieți în limbaj natural algoritmul proiectat, justificând eficiența acestuia. (2p.)\nb. Scrieți programul C/C++ corespunzător algoritmului proiectat. (8p.)",
            "exercise_number": "3"
        }
    }
}