{
    "subject_number": "III",
    "total_points": "30",
    "subject_title": "SUBIECTUL al III-lea",
    "exercises": {
        "1": {
            "content": "Subprogramul produs are doi parametri, a și b, prin care primește câte un număr natural din intervalul\n[1,103]. Subprogramul returnează produsul divizorilor naturali comuni lui a și b.\nScrieți definiția completă a subprogramului.\nExemplu: dacă a=20 și b=12, atunci subprogramul returnează valoarea 8 (1∙2∙4=8). (10p.)",
            "exercise_number": "1"
        },
        "2": {
            "content": "Un text are cel mult 100 de caractere, iar cuvintele sale sunt formate numai din litere mici ale alfabetului\nenglez, sunt distincte și sunt separate prin câte un spațiu. Scrieți un program C/C++ care citește de la\ntastatură un număr natural n (n[1,102]), apoi un text de tipul precizat mai sus, și afișează pe ecran\ncuvinte ale acestuia, pe două linii separate, astfel încât prima linie să conțină mulțimea cuvintelor care\nau mai puțin de n litere, iar a doua linie să conțină mulțimea cuvintelor care au mai mult de n litere.\nCuvintele de pe fiecare linie sunt afișate într-o ordine oarecare, iar dacă una dintre cele două mulțimi\neste vidă, se afișează pe ecran doar mesajul nu exista.\nExemplu: pentru n=3 și textul era o apa rece si cu gust bun\nse poate afișa pe ecran textul alăturat. (10p.)\no si cu\nrece gust",
            "exercise_number": "2"
        },
        "3": {
            "content": "La un concurs se acordă premiile I, al II-lea și al III-lea. Fiecare premiant este recompensat cu câte o\ncarte, care are un preț egal pentru toți cei cu același premiu. Prețurile cărților alese pentru premiile I, al IIlea și al III-lea sunt stabilite astfel încât să fie în ordine strict descrescătoare, iar pentru fiecare premiu să\nse ia în considerare cel mai mare preț pentru care există suficiente cărți propuse, în condițiile precizate.\nFișierul bac.txt conține pe prima linie trei numere naturale din intervalul [1,20], n1, n2 și n3,\nreprezentând numărul concurenților care primesc premiile I, al II-lea, respectiv al III-lea, iar pe a doua\nlinie un șir de cel mult 106 numere naturale din intervalul [10,103], separate prin câte un spațiu,\nfiecare număr reprezentând prețul unei cărți propuse pentru premiere.\nSe cere să se afișeze pe ecran, separate prin câte un spațiu, în ordine strict descrescătoare, prețurile cărților\nalese, corespunzătoare celor trei premii, iar dacă nu există trei astfel de prețuri, se afișează mesajul\nnu exista. Proiectați un algoritm eficient din punctul de vedere al timpului de executare.\nExemplu: dacă fișierul conține valorile\n3 2 4\n500 100 25 100 200 100 20 10 200 100 75 52 52 15 52 20 20 10 30 20 5 100\nse afișează pe ecran, în această ordine, numerele 100 52 20.\na. Descrieți în limbaj natural algoritmul proiectat, justificând eficiența acestuia. (2p.)\nb. Scrieți programul C/C++ corespunzător algoritmului proiectat. (8p.)",
            "exercise_number": "3"
        }
    }
}